apache-camel-demo-cxf/src/main/resources/META-INF/wsdl/helloworld.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
xmlns:wsp="http://www.w3.org/ns/ws-policy"
xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:tns="http://cxf.camel.demos.mycompany.com/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns="http://schemas.xmlsoap.org/wsdl/"
targetNamespace="http://cxf.camel.demos.mycompany.com/"
name="HelloWorldService">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://cxf.camel.demos.mycompany.com/" schemaLocation="helloworld.xsd"/>
    </xsd:schema>
  </types>
  <message name="greet">
    <part name="parameters" element="tns:greet"/>
  </message>
  <message name="greetResponse">
    <part name="parameters" element="tns:greetResponse"/>
  </message>
  <portType name="HelloWorld">
    <operation name="greet">
      <input wsam:Action="http://cxf.camel.demos.mycompany.com/HelloWorld/greetRequest" message="tns:greet"/>
      <output wsam:Action="http://cxf.camel.demos.mycompany.com/HelloWorld/greetResponse" message="tns:greetResponse"/>
    </operation>
  </portType>
  <binding name="HelloWorldPortBinding" type="tns:HelloWorld">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="greet">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="HelloWorldService">
    <port name="HelloWorldPort" binding="tns:HelloWorldPortBinding">
      <soap:address location="http://localhost:9000/services/HelloWorld"/>
    </port>
  </service>
</definitions>